Repository: Kamisato-Yuna/TableViewer
Catalog: TableViewer/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# 请先连接数据库。
source: Connect to a database first.
zh_hans: 请先连接数据库。

# 请填写连接名称。
source: Enter a connection name.
zh_hans: 请填写连接名称。

# 请检查地址、模型与 API Key。
source: Check the URL, model, and API key.
zh_hans: 请检查地址、模型与 API Key。

# 请求用户批准后检查当前数据库的表/集合及当前表字段；不会读取记录。
source: Request user approval to inspect tables/collections and the current table's fields. Does not read records.
zh_hans: 请求用户批准后检查当前数据库的表/集合及当前表字段；不会读取记录。

# 请输入 SQL 语句。
source: Enter a SQL statement.
zh_hans: 请输入 SQL 语句。

# 请输入一个 JSON 对象。
source: Enter a JSON object.
zh_hans: 请输入一个 JSON 对象。

# 请输入不包含凭据、查询参数或片段的 API Base URL。
source: Enter an API base URL without credentials, query parameters, or fragments.
zh_hans: 请输入不包含凭据、查询参数或片段的 API Base URL。

# 请选择数据库所在的文件夹。
source: Select the folder containing the database.
zh_hans: 请选择数据库所在的文件夹。

# 读取副本集状态…
source: Reading replica set status…
zh_hans: 读取副本集状态…

# 读取数据…
source: Loading data…
zh_hans: 读取数据…

# 跟随系统
source: Follow System
zh_hans: 跟随系统

# 输入 Extended JSON 文档；省略 _id 时由 MongoDB 生成。
source: Enter an Extended JSON document. MongoDB generates _id if omitted.
zh_hans: 输入 Extended JSON 文档；省略 _id 时由 MongoDB 生成。

# 输入 JSON 数据库命令，例如 find、aggregate 或 update。
source: Enter a JSON database command, such as find, aggregate, or update.
zh_hans: 输入 JSON 数据库命令，例如 find、aggregate 或 update。

# 输入 JavaScript 表达式、db 命令或 rs.status()。变量和游标会在本会话内保留。
source: Enter JavaScript expressions, db commands, or rs.status(). Variables and cursors persist for this session.
zh_hans: 输入 JavaScript 表达式、db 命令或 rs.status()。变量和游标会在本会话内保留。

# 运行
source: Run
zh_hans: 运行

# 运行中…
source: Running…
zh_hans: 运行中…

# 运行查询
source: Run Query
zh_hans: 运行查询

# 返回数据页选择一条记录，查看和编辑字段。
source: Return to Data and select a record to inspect and edit its fields.
zh_hans: 返回数据页选择一条记录，查看和编辑字段。

# 还没有记录
source: No records yet
zh_hans: 还没有记录

# 远程 API 请使用 HTTPS；若使用可信内网 HTTP，请在配置中明确启用。
source: Use HTTPS for remote APIs. Explicitly enable HTTP in settings only for a trusted private network.
zh_hans: 远程 API 请使用 HTTPS；若使用可信内网 HTTP，请在配置中明确启用。

# 连接
source: Connections
zh_hans: 连接

# 连接 OpenAI-compatible API
source: Connect an OpenAI-compatible API
zh_hans: 连接 OpenAI-compatible API

# 连接 URI
source: Connection URI
zh_hans: 连接 URI

# 连接、探索、编辑。一个安静而专注的数据工作台。
source: Connect, explore, edit. A quiet workspace for your data.
zh_hans: 连接、探索、编辑。一个安静而专注的数据工作台。

# 连接中…
source: Connecting…
zh_hans: 连接中…

# 连接你的 AI
source: Connect Your AI
zh_hans: 连接你的 AI

# 连接你的数据库
source: Connect Your Database
zh_hans: 连接你的数据库

# 连接名称
source: Connection Name
zh_hans: 连接名称

# 连接已移除
source: Connection removed
zh_hans: 连接已移除

# 连接成功 · 发现 %lld 个模型。未发送数据库内容。
source: Connected · Found %lld models. No database content was sent.
zh_hans: 连接成功 · 发现 %lld 个模型。未发送数据库内容。

# 连接成功 · 发现 %lld 个表 / 集合
source: Connected · Found %lld tables / collections
zh_hans: 连接成功 · 发现 %lld 个表 / 集合

# 连接配置读取失败，原文件已保留：
source: Unable to read connection settings. The original file was preserved:
zh_hans: 连接配置读取失败，原文件已保留：

# 退出
source: Quit
zh_hans: 退出

# 退出 TableViewer？
source: Quit TableViewer?
zh_hans: 退出 TableViewer？

# 选择
source: Choose
zh_hans: 选择

# 选择…
source: Choose…
zh_hans: 选择…

# 选择一条记录
source: Select a record
zh_hans: 选择一条记录

# 配置你的 AI 助手
source: Configure your AI assistant
zh_hans: 配置你的 AI 助手

# 重置会话
source: Reset Session
zh_hans: 重置会话

# 重试
source: Retry
zh_hans: 重试

# 钥匙串删除失败（%d）。
source: Keychain deletion failed (%d).
zh_hans: 钥匙串删除失败（%d）。

# 钥匙串更新失败（%d）。
source: Keychain update failed (%d).
zh_hans: 钥匙串更新失败（%d）。

# 附带当前表结构
source: Include current schema
zh_hans: 附带当前表结构

# 集合
source: Collection
zh_hans: 集合

# 验证证书和主机
source: Verify Certificate & Host
zh_hans: 验证证书和主机

# 默认值
source: Default
zh_hans: 默认值

source: Invalid MongoDB URI. Check the connection settings.
zh_hans: MongoDB URI 无效，请检查连接设置。

source: Unable to create a MongoDB client.
zh_hans: 无法创建 MongoDB 客户端。

source: ObjectId must be a 24-character hexadecimal string
zh_hans: ObjectId 必须是 24 位十六进制字符串

source: The cursor has already started
zh_hans: 游标已经执行

source: limit must be between 0 and 1000
zh_hans: limit 范围为 0…1000

source: skip must be a nonnegative integer set before running
zh_hans: skip 需要非负整数且必须在运行前设置

source: The command returned no cursor
zh_hans: 命令没有返回游标

source: Enter it to display the next batch.
zh_hans: 输入 it 继续显示下一批。

source: No cursor to continue.
zh_hans: 没有待继续的游标。

source: A little clarity for your data.
zh_hans: 让数据变得清晰。

# ⌘↩ 发送 · Return 换行 · 等待批准时仍可写草稿
source: ⌘↩ to send · Return for a new line · Draft while awaiting approval
zh_hans: ⌘↩ 发送 · Return 换行 · 等待批准时仍可写草稿

# 信息不足时向用户提出一个短问题，最多三个选项，用户也可自由补充。回答不代表数据库操作授权。
source: When information is missing, ask one short question with up to three options and allow a freeform answer. An answer does not authorize database operations.
zh_hans: 信息不足时向用户提出一个短问题，最多三个选项，用户也可自由补充。回答不代表数据库操作授权。

# 停止并发送补充
source: Stop and send follow-up
zh_hans: 停止并发送补充

# 可先写草稿。⌘↩ 停止当前生成，并携带已有回复与补充重新请求。
source: Write a draft anytime. ⌘↩ stops generation and starts a new request with the partial reply and your follow-up.
zh_hans: 可先写草稿。⌘↩ 停止当前生成，并携带已有回复与补充重新请求。

# 回到底部
source: Back to bottom
zh_hans: 回到底部

# 回答与结果目前只在本机。确认后会发送给所配置的 API；回答问题不代表批准数据库操作。
source: Answers and results are currently local. Confirm to send them to the configured API. Answering a question does not approve database operations.
zh_hans: 回答与结果目前只在本机。确认后会发送给所配置的 API；回答问题不代表批准数据库操作。

# 回答仅用于澄清需求；数据库操作仍需单独批准。
source: Your answer clarifies the request. Database operations still need separate approval.
zh_hans: 回答仅用于澄清需求；数据库操作仍需单独批准。

# 复制代码
source: Copy code
zh_hans: 复制代码

# 复制回复
source: Copy reply
zh_hans: 复制回复

# 已停止 · 已保留部分回复
source: Stopped · Partial reply preserved
zh_hans: 已停止 · 已保留部分回复

# 已发送的回答或结果
source: Shared answer or result
zh_hans: 已发送的回答或结果

# 已回答
source: Answered
zh_hans: 已回答

# 已复制
source: Copied
zh_hans: 已复制

# 已完成
source: Completed
zh_hans: 已完成

# 已拒绝 · 未执行
source: Declined · Not executed
zh_hans: 已拒绝 · 未执行

# 执行中
source: Executing
zh_hans: 执行中

# 执行失败
source: Execution failed
zh_hans: 执行失败

# 查看本地回答或结果（尚未发送）
source: View local answer or result (not shared)
zh_hans: 查看本地回答或结果（尚未发送）

# 模型输出达到上限，已保留部分回复；可继续或重新生成。未执行本次工具。
source: The model reached its output limit. The partial reply is preserved; continue or regenerate. Tools from this response were not executed.
zh_hans: 模型输出达到上限，已保留部分回复；可继续或重新生成。未执行本次工具。

# 正在准备回复…
source: Preparing a reply…
zh_hans: 正在准备回复…

# 正在执行已批准的操作…
source: Executing the approved operation…
zh_hans: 正在执行已批准的操作…

# 正在生成回复…
source: Generating a reply…
zh_hans: 正在生成回复…

# 澄清问题格式无效，请模型重新提问。
source: Invalid clarification format. Ask the model to rephrase the question.
zh_hans: 澄清问题格式无效，请模型重新提问。

# 生成失败 · 已保留部分回复
source: Generation failed · Partial reply preserved
zh_hans: 生成失败 · 已保留部分回复

# 确认回答（保留在本机）
source: Confirm answer (keep locally)
zh_hans: 确认回答（保留在本机）

# 等待你回答问题
source: Waiting for your answer
zh_hans: 等待你回答问题

# 等待你批准或拒绝操作
source: Waiting for you to approve or decline
zh_hans: 等待你批准或拒绝操作

# 等待你确认发送结果
source: Waiting for approval to share results
zh_hans: 等待你确认发送结果

# 等待回答
source: Awaiting your answer
zh_hans: 等待回答

# 等待批准
source: Awaiting approval
zh_hans: 等待批准

# 继续回复
source: Continue reply
zh_hans: 继续回复

# 自由补充或修改选项…
source: Add details or edit an option…
zh_hans: 自由补充或修改选项…

# 请接着上面的未完成回复继续，避免重复已有内容。
source: Continue the unfinished reply above without repeating existing content.
zh_hans: 请接着上面的未完成回复继续，避免重复已有内容。

# 重新生成
source: Regenerate
zh_hans: 重新生成

# 需要你补充
source: Your input is needed
zh_hans: 需要你补充

# 已停止 · 尚未收到正文
source: Stopped · No reply received yet
zh_hans: 已停止 · 尚未收到正文

# 生成失败 · 尚未收到正文
source: Generation failed · No reply received yet
zh_hans: 生成失败 · 尚未收到正文

# 新会话
source: New conversation
zh_hans: 新会话

# 应用已退出，无法确认这次操作是否完成。请核实数据库状态；不会自动重执行。
source: The app closed before the operation outcome could be confirmed. Verify the database state; it will not run again automatically.
zh_hans: 应用已退出，无法确认这次操作是否完成。请核实数据库状态；不会自动重执行。

# 会话历史读取失败，原文件已保留：
source: Could not load conversation history. The original file was preserved:
zh_hans: 会话历史读取失败，原文件已保留：

# 会话历史保存失败：
source: Could not save conversation history:
zh_hans: 会话历史保存失败：

# 结果待核实 · 不会自动重执行
source: Outcome unverified · No automatic replay
zh_hans: 结果待核实 · 不会自动重执行

# 生成已中断 · 可手动继续
source: Generation interrupted · Continue manually
zh_hans: 生成已中断 · 可手动继续

# Agent 仍在生成或执行。历史会保存在本机；退出后中断的操作不会自动重放，数据库执行结果可能需要核实。
source: Agent conversations are still generating or executing. History stays local. Interrupted work will not replay automatically; database outcomes may need verification.
zh_hans: Agent 仍在生成或执行。历史会保存在本机；退出后中断的操作不会自动重放，数据库执行结果可能需要核实。

# 请连接此会话原来的数据库后再批准操作。
source: Connect to this conversation's original database before approving operations.
zh_hans: 请连接此会话原来的数据库后再批准操作。

# 会话历史
source: Conversation history
zh_hans: 会话历史

# 创建会话后，消息和操作进度会保存在本机。
source: Messages and operation progress are saved locally for each conversation.
zh_hans: 创建会话后，消息和操作进度会保存在本机。

# 所有会话
source: All conversations
zh_hans: 所有会话

# 所属数据库：%@ · %@
source: Database: %@ · %@
zh_hans: 所属数据库：%@ · %@

# 已归档，运行进度仍会保留。
source: Archived. Ongoing work and progress are still retained.
zh_hans: 已归档，运行进度仍会保留。

# 恢复会话
source: Restore conversation
zh_hans: 恢复会话

# API 配置已变更。此历史仍可查看，请新建会话使用当前配置。
source: API settings have changed. This history remains readable. Create a new conversation to use the current settings.
zh_hans: API 配置已变更。此历史仍可查看，请新建会话使用当前配置。

# 正在查看其他数据库的会话；执行操作前需要连接原数据库。
source: You are viewing a conversation for another database. Connect to its original database before executing operations.
zh_hans: 正在查看其他数据库的会话；执行操作前需要连接原数据库。

# 连接原数据库
source: Connect to original database
zh_hans: 连接原数据库

# 原连接已不可用，历史仍保留。
source: The original connection is unavailable. History is preserved.
zh_hans: 原连接已不可用，历史仍保留。

# 通过此会话的独立数据库连接执行；不继承查询工作台事务。写入语句会修改数据。
source: Runs through this conversation's separate database connection, without inheriting query workspace transactions. Writes modify data.
zh_hans: 通过此会话的独立数据库连接执行；不继承查询工作台事务。写入语句会修改数据。

# Key 保存在 macOS 钥匙串。保存后创建使用当前配置的新会话；原有历史保留，不会自动发送给新服务。
source: Keys stay in macOS Keychain. Saving creates a new conversation using these settings. Existing history is retained and is not sent automatically to the new service.
zh_hans: Key 保存在 macOS 钥匙串。保存后创建使用当前配置的新会话；原有历史保留，不会自动发送给新服务。

# 所有 Agent 会话
source: All Agent conversations
zh_hans: 所有 Agent 会话

# 历史仅保存在本机。归档可恢复，不会取消正在进行的任务。
source: History stays on this Mac. Archiving is reversible and does not cancel ongoing work.
zh_hans: 历史仅保存在本机。归档可恢复，不会取消正在进行的任务。

# 按标题或数据库搜索
source: Search title or database
zh_hans: 按标题或数据库搜索

# 已归档
source: Archived
zh_hans: 已归档

# 打开
source: Open
zh_hans: 打开

# 重命名
source: Rename
zh_hans: 重命名

# 归档会话
source: Archive conversation
zh_hans: 归档会话

# 会话操作
source: Conversation actions
zh_hans: 会话操作

# 新会话所属数据库
source: Database for new conversation
zh_hans: 新会话所属数据库

# 选择数据库
source: Choose a database
zh_hans: 选择数据库

# 新建会话
source: New conversation
zh_hans: 新建会话

# 重命名会话
source: Rename conversation
zh_hans: 重命名会话

# 会话标题
source: Conversation title
zh_hans: 会话标题

# Agent 会话
source: Agent conversations
zh_hans: Agent 会话

# %lld 个会话进行中
source: %lld conversations in progress
zh_hans: %lld 个会话进行中

# %lld 个会话等待处理
source: %lld conversations need attention
zh_hans: %lld 个会话等待处理

# 未能读取连接凭据，尚未切换数据库。请重试或选择其他连接。
source: Could not read connection credentials. The database has not been switched. Retry or choose another connection.
zh_hans: 未能读取连接凭据，尚未切换数据库。请重试或选择其他连接。

# 已取消读取钥匙串凭据。
source: Keychain credential access was cancelled.
zh_hans: 已取消读取钥匙串凭据。

# 钥匙串未授权读取凭据，请重试并允许访问。
source: Keychain did not authorize credential access. Retry and allow access.
zh_hans: 钥匙串未授权读取凭据，请重试并允许访问。

# 点击回复
source: Click to reply
zh_hans: 点击回复

# 点击选项回复，也可以在下方自行输入。
source: Click an option to reply, or write your own message below.
zh_hans: 点击选项回复，也可以在下方自行输入。

# 使用此选项回答（保留在本机）
source: Answer with this option (kept locally)
zh_hans: 使用此选项回答（保留在本机）

# 模型未提供有效的问题文字，请重新提问。
source: The model did not provide a valid question. Please ask again.
zh_hans: 模型未提供有效的问题文字，请重新提问。

# 模型的问题为空或过长，请重新提问。
source: The model question is empty or too long. Please ask again.
zh_hans: 模型的问题为空或过长，请重新提问。

# 模型的选项格式无效，请使用文字选项重新提问。
source: The model options are invalid. Please ask again using text options.
zh_hans: 模型的选项格式无效，请使用文字选项重新提问。

# 模型提供的选项过多，请缩小范围后重新提问。
source: The model provided too many options. Please narrow the choices and ask again.
zh_hans: 模型提供的选项过多，请缩小范围后重新提问。

# 模型的选项文字过长，请简化后重新提问。
source: The model options are too long. Please shorten them and ask again.
zh_hans: 模型的选项文字过长，请简化后重新提问。

# 问题需要重试
source: Question needs retry
zh_hans: 问题需要重试

# 信息不足时向用户提出一个短问题。通常提供两到三个选项，选择表或字段时最多十二个；也可不提供选项让用户自由回答。回答不代表数据库操作授权。
source: Ask a short clarification question. Usually provide two or three options, or up to twelve for tables or fields. Options may be omitted for a freeform answer. An answer does not authorize database operations.
zh_hans: 信息不足时向用户提出一个短问题。通常提供两到三个选项，选择表或字段时最多十二个；也可不提供选项让用户自由回答。回答不代表数据库操作授权。

# 这条历史问题的选项现在可以正常显示，无需重新请求模型。
source: The options in this saved question can now be displayed without another model request.
zh_hans: 这条历史问题的选项现在可以正常显示，无需重新请求模型。

# 恢复问题选项
source: Restore question options
zh_hans: 恢复问题选项

# 让模型重新提问
source: Ask the model again
zh_hans: 让模型重新提问

# 尚未检查更新
source: No update check yet
zh_hans: 尚未检查更新

# 正在检查更新…
source: Checking for updates…
zh_hans: 正在检查更新…

# 发现新版本：%@
source: New version available: %@
zh_hans: 发现新版本：%@

# 当前已是最新版本
source: You’re up to date
zh_hans: 当前已是最新版本

# 更新已下载，将在退出应用后安装
source: Update downloaded. It will install when you quit.
zh_hans: 更新已下载，将在退出应用后安装

# 应用更新
source: App Updates
zh_hans: 应用更新

# 自动检查更新
source: Automatically check for updates
zh_hans: 自动检查更新

# 自动下载并在退出后安装
source: Automatically download and install on quit
zh_hans: 自动下载并在退出后安装

# 从 GitHub 获取正式版本。更新包验证通过后才会安装，重启前仍会提醒保存未完成的工作。
source: Get stable releases from GitHub. Updates are verified before installation. You will still be prompted about unfinished work before restarting.
zh_hans: 从 GitHub 获取正式版本。更新包验证通过后才会安装，重启前仍会提醒保存未完成的工作。

# 检查更新…
source: Check for Updates…
zh_hans: 检查更新…

# 发行说明
source: Release Notes
zh_hans: 发行说明

# 上次检查
source: Last checked
zh_hans: 上次检查

# 数据库对象
source: Database Objects
zh_hans: 数据库对象

# %lld 个对象
source: %lld objects
zh_hans: %lld 个对象

# 全部
source: All
zh_hans: 全部

# 分类
source: Category
zh_hans: 分类

# 表
source: Tables
zh_hans: 表

# 表与视图
source: Tables and Views
zh_hans: 表与视图

# 集合与视图
source: Collections and Views
zh_hans: 集合与视图

# 查找名称或架构
source: Search names or schemas
zh_hans: 查找名称或架构

# 没有匹配的对象
source: No Matching Objects
zh_hans: 没有匹配的对象

# 打开 %@
source: Open %@
zh_hans: 打开 %@

# 实体关系
source: Entity Relationships
zh_hans: 实体关系

# 显示数据库声明的外键：引用字段 → 被引用字段。点击表名可打开对象。
source: Declared foreign keys: referencing fields → referenced fields. Click a table name to open it.
zh_hans: 显示数据库声明的外键：引用字段 → 被引用字段。点击表名可打开对象。

# 查找表或外键
source: Search tables or foreign keys
zh_hans: 查找表或外键

# MongoDB 没有声明式外键
source: MongoDB Has No Declarative Foreign Keys
zh_hans: MongoDB 没有声明式外键

# 没有匹配的外键关系
source: No Matching Foreign Keys
zh_hans: 没有匹配的外键关系

# 不根据字段名称或数据值推断关系。
source: Relationships are not inferred from field names or values.
zh_hans: 不根据字段名称或数据值推断关系。

# 引用
source: References
zh_hans: 引用

# 结构 · %@
source: Structure · %@
zh_hans: 结构 · %@

# 查看 DDL
source: View DDL
zh_hans: 查看 DDL

# 查看定义
source: View Definition
zh_hans: 查看定义

# 查找字段
source: Search fields
zh_hans: 查找字段

# 约束
source: Constraints
zh_hans: 约束

# 索引（%lld）
source: Indexes (%lld)
zh_hans: 索引（%lld）

# 集合定义
source: Collection Definition
zh_hans: 集合定义

# 无法导出
source: Unable to Export
zh_hans: 无法导出

# MongoDB 没有声明式外键；此处展示集合定义、验证器声明字段和索引，不推断文档间关联。定义导出为 JSON。
source: MongoDB has no declarative foreign keys. Collection definitions, validator fields and indexes are shown without inferring relationships. Definitions export as JSON.
zh_hans: MongoDB 没有声明式外键；此处展示集合定义、验证器声明字段和索引，不推断文档间关联。定义导出为 JSON。

# SQLite 原始建表/视图定义包含 CHECK、复合约束及生成列表达式；筛选标签仅标记已读取的字段约束。
source: Original SQLite table/view definitions include CHECK constraints, composite constraints and generated expressions. Filter tags reflect retrieved field constraints.
zh_hans: SQLite 原始建表/视图定义包含 CHECK、复合约束及生成列表达式；筛选标签仅标记已读取的字段约束。

# PostgreSQL 目录元数据；UNIQUE MEMBER 表示参与唯一约束，复合约束不保证单列唯一。DDL 为结构参考，完整迁移请使用 pg_dump。
source: PostgreSQL catalog metadata. UNIQUE MEMBER means participation in a unique constraint; composite constraints do not imply single-column uniqueness. DDL is a structural reference; use pg_dump for complete migration.
zh_hans: PostgreSQL 目录元数据；UNIQUE MEMBER 表示参与唯一约束，复合约束不保证单列唯一。DDL 为结构参考，完整迁移请使用 pg_dump。
